
1. Напишите программу, которая находит первую заглавную букву в строке, используя рекурсию. Написать 4 существенно разных теста

2. Напишите программу, которая по заданной строке (в английском алфавите) определяет длину самой длинной подстроки, где буквы будут чередоваться (прописная/строчная). При этом число гласных и согласных в этой строке должно совпадать. Сложность решения должна быть n log n, где n - это длины строки

3. Создать класс "Дробное число". Выделить необходимые поля(числитель и знаменатель). Создать конструктор, позволяющий задать все поля объекта.
Методы:
- сократить дробь
- операции сложения, перемножения.
- переопределить Equals и ToString
В другом классе создать static-методы, вычисляющие сумму массива дробей, а также проверку, что в массиве дробей есть хотя бы 2 одинаковых.

4. Нарисовать карту памяти в момент вывода "!", при условии, что не было сборки мусора

class B 
{
	public static int i;
	public static string s;
	public int d;
	public B b;
}
static void F(B[] bb, B b) 
{
	if (B.i = bb.Length) return;
	bb[B.i].b = b;
	b.d++;
	B.i++;
	F(bb, bb[B.i]);
	b = bb[B.i].b;
	Console.WriteLine("!");
}
static void Main() 
{
	B[] bb = new B[4];
	bb[0] = new B { d = 2 };
	bb[1] = new B { d = 3, b = bb[0] };
	bb[2] = new B { d = 4, b = bb[1] };
	bb[3] = new B { d = 4, b = bb[1].b };
	B.s = "asd";
	B.i++;
	F(bb, bb[B.i]);
}
